In [33]:
import pandas as pd

In [34]:
df = pd.read_excel(fr"C:\Users\Gabriel\Documents\Histórico Gabriel\Cursos\Udemy\Domine a Análise de Dados\teste.xlsx", sheet_name="Dado3")

In [35]:
df.head()

   ID      Nome  Idade       Cidade
0  11   Juliana     26        Natal
1  12    Sérgio     33       Cuiaba
2  13  Gabriela     28      Vitória
3  14   Eduardo     31       Maceió
4  15     Carla     24  João Pessoa

In [36]:
### Adicionando colunas
df = pd.read_excel(fr"C:\Users\Gabriel\Documents\Histórico Gabriel\Cursos\Udemy\Domine a Análise de Dados\teste.xlsx", index_col=0)

In [37]:
df.head()

        Nome  Idade          Cidade
ID
1        Ana     23       São Paulo
2     Carlos     30  Rio de Janeiro
3      Lucas     25        Curitiba
4   Fernanda     28    Porto Alegre
5    Mariana     22        Salvador

In [38]:
### Importando colunas específicas
df = pd.read_excel(fr"C:\Users\Gabriel\Documents\Histórico Gabriel\Cursos\Udemy\Domine a Análise de Dados\teste.xlsx", usecols=[1,2], index_col=0)
df.head()

          Idade
Nome
Ana          23
Carlos       30
Lucas        25
Fernanda     28
Mariana      22

In [39]:
### Gerando uma novo arquivo para os dados - Exportando dados na planilha
df1 = pd.read_excel(fr"C:\Users\Gabriel\Documents\Histórico Gabriel\Cursos\Udemy\Domine a Análise de Dados\teste.xlsx", sheet_name="Dado1")
df2 = pd.read_excel(fr"C:\Users\Gabriel\Documents\Histórico Gabriel\Cursos\Udemy\Domine a Análise de Dados\teste.xlsx", sheet_name="Dado2")

In [40]:
with pd.ExcelWriter(fr"C:\Users\Gabriel\Documents\Histórico Gabriel\Cursos\Udemy\Domine a Análise de Dados\teste.xlsx") as nova_planilha:
    df1.to_excel(nova_planilha, sheet_name="Aba1", index=False)
    df2.to_excel(nova_planilha, sheet_name="Aba2", index=False)